---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ThermalExpansionCoefficient
source: html/1b7c6e26-f9b9-8fd8-14bd-84280f1b6586.htm
---
# Autodesk.Revit.DB.SpecTypeId.ThermalExpansionCoefficient Property

Thermal Expansion Coefficient, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalExpansionCoefficient { get; }
```